Tekla.Structures.Drawing.Arc
The Arc class defines an arc that is a two-point line with an optional curve radius.
It can be created using either two points and a radius or three points.
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
if(MyDrawingHandler.GetConnectionStatus())
{
Arc MyArc;
DrawingObjectEnumerator views = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
while(views.MoveNext())
{
MyArc = new Arc(views.Current as ViewBase, new Point(10, 10), new Point(200, 200), 300);
MyArc.Insert();
}
}
}
}

Tekla.Structures.Drawing.Arc.StartPoint
The start point of the arc.

Tekla.Structures.Drawing.Arc.EndPoint
The end point of the arc.

Tekla.Structures.Drawing.Arc.Radius
The radius of the arc.

Tekla.Structures.Drawing.Arc.IsLargeArc
Whether the arc is a large arc or not.

Tekla.Structures.Drawing.Arc.Attributes
The attributes of the arc.

Tekla.Structures.Drawing.Arc.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.Arc.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double,Tekla.Structures.Drawing.Arc.ArcAttributes)
Creates a new arc instance with the given two points, radius and specified attributes.
inView: The view to be used.
inPoint1: The start point to be used.
inPoint2: The end point to be used.
inRadius: The radius to be used.
inAttributes: The arc attributes to be used.

Tekla.Structures.Drawing.Arc.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Arc,Tekla.Structures.Drawing.Arc.ArcAttributes)
Creates a new arc instance with the given geometrical arc and specified attributes.
inView:
geometricalArc:
inAttributes:

Tekla.Structures.Drawing.Arc.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.Arc.ArcAttributes)
Creates a new arc instance with the given three points and specified attributes.
inView: The view to be used.
StartPoint: The start point to be used.
EndPoint: The end point to be used.
CenterPoint: The center point to be used.
inAttributes: The arc attributes to be used.

Tekla.Structures.Drawing.Arc.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double)
Creates a new arc instance with standard attributes and the given two points and radius.
inView: The view to be used.
inPoint1: The start point to be used.
inPoint2: The end point to be used.
inRadius: The radius to be used.

Tekla.Structures.Drawing.Arc.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Creates a new arc instance with standard attributes and the given three points.
inView: The view to be used.
inPoint1: The start point to be used.
inPoint2: The end point to be used.
inPoint3: The center point to be used.

Tekla.Structures.Drawing.Arc.GetGeometricalArc
Gets the geometrical arc representation of the drawing arc.
Returns: Geometry3d.Arc

Tekla.Structures.Drawing.Arc.Delete
Calls the system to delete the object.
Returns: True on success.

Tekla.Structures.Drawing.Arc.Modify
Calls the system to update/modify the object.
Returns: True on success.

Tekla.Structures.Drawing.Arc.Insert
Calls the system to insert the new object.
Returns: True on success.

Tekla.Structures.Drawing.Arc.Select
Calls the system to select and retrieve the object.
Returns: True on success.